### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [80]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [81]:
purchase_data.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

In [82]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [83]:
purchase_data.shape

(780, 7)

In [5]:
#purchase_data["SN"].unique()

In [84]:
Total_Players = len(purchase_data["SN"].unique())
Total_Players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [7]:
unique_items = len(purchase_data["Item ID"].unique())
average_price = purchase_data["Price"].mean()
purchases = purchase_data["Purchase ID"].count()
total_revenue = purchase_data["Price"].sum()

In [8]:
summary_table = pd.DataFrame({"Number of Unique Items": unique_items,
                              "Average Price": [average_price],
                              "Number of Purchases": [purchases],
                              "Total Revenue": [total_revenue]})
summary_table

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [9]:
unique_sn_df = purchase_data[["Gender", "SN"]].drop_duplicates()

In [10]:
total_gender = unique_sn_df["Gender"].count()
male2 = unique_sn_df["Gender"].value_counts()['Male']
female2 = unique_sn_df["Gender"].value_counts()['Female']
other2 = total_gender - male2 - female2

In [11]:
male_percent = (male2/total_gender) * 100
female_percent = (female2/total_gender) * 100
other_percent = (other2/total_gender) * 100

In [12]:
Demo_table = pd.DataFrame({"Male": male_percent,
                            "Female": [female_percent],
                            "Other/Non-Disclosed": [other_percent]})

Demo_table

        Male   Female  Other/Non-Disclosed
0  84.027778  14.0625             1.909722

In [13]:
Demo_table["Male"]=Demo_table["Male"].map(
    "{0:,.2f}%".format)
Demo_table["Female"]=Demo_table["Female"].map(
    "{0:,.2f}%".format)
Demo_table["Other/Non-Disclosed"]=Demo_table["Other/Non-Disclosed"].map(
    "{0:,.2f}%".format)

Demo_table

     Male  Female Other/Non-Disclosed
0  84.03%  14.06%               1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [14]:
grouped_by_gender = purchase_data.groupby(["Gender"])

grouped_by_gender["Purchase ID"].count()
grouped_by_gender["Price"].mean()
grouped_by_gender["Price"].sum()

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [15]:
#pd.concat([gender_purch_cnt, gender_purch_mean, gender_purch_sum], axis=1)

In [16]:
gender_purch_cnt=purchase_data.groupby("Gender")["Purchase ID"].count()
gender_purch_mean=purchase_data.groupby("Gender")["Price"].mean()
gender_purch_sum=purchase_data.groupby("Gender")["Price"].sum()

In [17]:
gender_purch_avgm= (gender_purch_sum/male2)
gender_purch_avgf= (gender_purch_sum/female2)
gender_purch_avgo= (gender_purch_sum/other2)

In [56]:
purch_analy =pd.DataFrame({"Purchase Count": gender_purch_cnt, "Average Purchase Price": gender_purch_mean, "Total Purchase Value": gender_purch_sum
             ,"Average Purchase Total per Person by Gender": gender_purch_avgm})

purch_analy

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person by Gender
Gender,,,,
Female,113,3.203009,361.94,0.747810
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,0.103698

In [57]:
purch_analy["Purchase Count"]=purch_analy["Purchase Count"].map(
    "{0:,.2f}".format)
purch_analy["Average Purchase Price"]=purch_analy["Average Purchase Price"].map(
    "${0:,.2f}".format)
purch_analy["Total Purchase Value"]=purch_analy["Total Purchase Value"].map(
"${0:,.2f}".format)
purch_analy["Average Purchase Total per Person by Gender"]=purch_analy["Average Purchase Total per Person by Gender"].map(
"${0:,.2f}".format)

purch_analy

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person by Gender
Gender,,,,
Female,113.00,$3.20,$361.94,$0.75
Male,652.00,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15.00,$3.35,$50.19,$0.10

In [55]:
purch_analy["Purchase Count"]

Gender
Female                   113.00
Male                     652.00
Other / Non-Disclosed     15.00
Name: Purchase Count, dtype: object

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [20]:
unique_sn_df2 = purchase_data[["Gender", "SN", "Age"]].drop_duplicates()

In [21]:
unique_sn_df2.head()

  Gender             SN  Age
0   Male        Lisim78   20
1   Male    Lisovynya38   40
2   Male     Ithergue48   24
3   Male  Chamassasya86   24
4   Male      Iskosia90   23

In [76]:
purchase_data.shape

(780, 8)

In [23]:
age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 49]
age_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [59]:
pd.cut(purchase_data["Age"], age_bins, labels = age_labels)

0      20-24
1        40+
2      20-24
3      20-24
4      20-24
5      20-24
6      35-39
7      20-24
8      20-24
9      35-39
10     20-24
11     20-24
12     20-24
13     20-24
14     35-39
15     20-24
16     20-24
17     20-24
18     20-24
19     30-34
20     20-24
21     20-24
22     35-39
23       40+
24     30-34
25     25-29
26     10-14
27       <10
28     20-24
29     20-24
       ...
750    20-24
751    10-14
752    15-19
753    35-39
754    20-24
755    10-14
756    20-24
757    15-19
758    20-24
759    25-29
760    20-24
761      40+
762    25-29
763    20-24
764    15-19
765    15-19
766    20-24
767      <10
768    35-39
769    15-19
770    30-34
771    15-19
772    25-29
773    20-24
774    10-14
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [86]:
purchase_data["Age Group"] = pd.cut(unique_sn_df2["Age"], age_bins, labels = age_labels)

purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [87]:
purchase_data.shape

(780, 8)

In [88]:
age_group = purchase_data.groupby("Age Group")

In [89]:
age_group.SN.nunique()

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [67]:
age_demo = age_group["Age"].count()

In [68]:
age_demo_perc= (age_demo/Total_Players) * 100

In [69]:
age_demo_perc

Age Group
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: Age, dtype: float64

In [70]:
age_df = pd.DataFrame({"Total Count": age_demo, "Percentage of Players": age_demo_perc})

In [71]:
#age_df

In [72]:
age_df["Total Count"]=age_df["Total Count"].map(
    "{0:,.2f}".format)
age_df["Percentage of Players"]=age_df["Percentage of Players"].map(
    "{0:,.2f}%".format)

In [73]:
age_df

          Total Count Percentage of Players
Age Group
<10             17.00                 2.95%
10-14           22.00                 3.82%
15-19          107.00                18.58%
20-24          258.00                44.79%
25-29           77.00                13.37%
30-34           52.00                 9.03%
35-39           31.00                 5.38%
40+             12.00                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [115]:
unique_sn_df3 = purchase_data

In [116]:
age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 49]
age_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
pd.cut(unique_sn_df3["Age"], age_bins, labels = age_labels).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [117]:
unique_sn_df3["Age Group"] = pd.cut(unique_sn_df3["Age"], age_bins, labels = age_labels)

In [122]:
age_group2 = unique_sn_df3.groupby("Age Group")

print(age_group2["Age"].count())

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Age, dtype: int64

In [123]:
prod_purchase = age_group2["Age"].count()

In [130]:
age_group_users = age_group.SN.nunique()

In [131]:
tot_price = age_group2.sum()["Price"]

In [134]:
avg_tot_per_person = tot_price / age_group_users

In [135]:
avg_purchase_price = tot_price / prod_purchase

In [ ]:
#avg_purch_price

In [93]:
avg_purch_price2 = (avg_purch_price/age_demo2)

In [94]:
#avg_purch_price2

In [95]:
avg_total_pp = (avg_purch_price/age_group2)

In [96]:
#avg_total_pp

In [136]:
age_df2 = pd.DataFrame({"Purchase Count": prod_purchase, "Average Purchase Price": avg_purchase_price, "Total Purchase Value": tot_price, "Avg Total Purchase per Person": avg_tot_per_person})

In [137]:
age_df2

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Group,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [138]:
top_spend = purchase_data.groupby(["SN"])

In [143]:
user_purch_count = top_spend.count()["Price"]

In [145]:
user_total_price = top_spend.sum()["Price"]

In [148]:
top_spenders_final = pd.DataFrame({"a": user_purch_count, "b": user_total_price})

In [151]:
top_spenders_final.sort_values("b", ascending=False).head()

             a      b
SN
Lisosia93    5  18.96
Idastidru52  4  15.45
Chamjask73   3  13.83
Iral74       4  13.62
Iskadarya95  3  13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80